app/Controllers/EmpresaController.php

SELECT *
FROM `empresas`
WHERE `activo` = 1
AND `idempresa` = '9'
SELECT *
FROM `empresas`
WHERE `activo` = 1
---
    public function list(){
        try {
            $rol = intval($this->session->get('idrol'));
            $filtros = ['activo'=>true];
            if($rol === 3){
                $filtros['idempresa']=$this->session->get('idempresa');
            }

            $empresas = $this->empresa->where($filtros)->findAll();