app/Controllers/LoginController.php

   public function login(){
    try {
        $datos = $this->request->getJSON(true);
        if(!isset($datos['usuario']) || !isset($datos['clave'])){
            return $this->response->setStatusCode(400,'validation error')
            ->setJSON(['message'=>'Parametros invalidos']);
        }
        $usuario = $this->usuario->where([
            'usuario'=>trim($datos['usuario']),
            'activo'=>true
        ])->first();
---
SELECT *
FROM `usuarios`
WHERE `usuario` = 'prueba'
AND `activo` = 1
 LIMIT 1